Revit 2027 API
Form.AddEdge(Reference, Double, Reference, Double) Method
Add an edge to the form, connecting two edges on same/different profile, by a pair of specified edge/param.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddEdge(
	Reference startEdgeReference,
	double startParam,
	Reference endEdgeReference,
	double endParam
)
Public Sub AddEdge (
	startEdgeReference As Reference,
	startParam As Double,
	endEdgeReference As Reference,
	endParam As Double
)
public:
void AddEdge(
	Reference^ startEdgeReference,
	double startParam,
	Reference^ endEdgeReference,
	double endParam
)
member AddEdge :
        startEdgeReference : Reference *
        startParam : float *
        endEdgeReference : Reference *
        endParam : float -> unit
Parameters
startEdgeReference Reference
The geometry reference of start edge
startParam Double
The param on start edge to specify the location.
endEdgeReference Reference
The geometry reference of end edge
endParam Double
The param on end edge to specify the location.
See Also
Reference
Form Class
AddEdge Overload
Autodesk.Revit.DB Namespace